---
kind: property
id: P:Autodesk.Revit.DB.Mullion.MullionType
source: html/dafcb74e-0b8f-9ae1-a6ef-8bbc03989eb9.htm
---
# Autodesk.Revit.DB.Mullion.MullionType Property

The MullionType style of this Mullion.
Get - to access type of mullion
Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown.

## Syntax (C#)
```csharp
public MullionType MullionType { get; set; }
```